In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":['Harry', 'Rohan', 'Skillf', 'Shubh'],
    "marks":[92,34, 24, 17],
    "city":['Rampur','Kolkata', 'Bareilly', 'Antartica']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks       city
0   Harry     92     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [5]:
#to see the top most data
df.head(2)

    name  marks     city
0  Harry     92   Rampur
1  Rohan     34  Kolkata

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [7]:
#the numerical data are shown in details, like marks
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [8]:
#to convert into the csv file
df.to_csv('friends.csv')

In [9]:
#to hide the index
df.to_csv('friends_index_false.csv', index=False)

In [10]:
#to see the last most data
df.tail(1)

    name  marks       city
3  Shubh     17  Antartica

In [11]:
read=pd.read_csv('demo.csv')

In [12]:
read

     name  marks       city
0   Harry     92     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [13]:
# to read only the particular row like name, city etc
read['name']

0     Harry
1     Rohan
2    Skillf
3     Shubh
Name: name, dtype: object

In [14]:
# we even can read the data in the particular index like:

read['name'][0]

'Harry'

In [15]:
read['name'][0]='Harry'

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/454520273.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read['name'][0]='Harry'

In [16]:
# even can change the data,
read['marks'][0]=99
# although it is showing the warning, but the code has been  updated!!

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/2093934311.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  read['marks'][0]=99
/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/2093934311.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read['marks'][0]=99

In [17]:
read

     name  marks       city
0   Harry     99     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [18]:
#to convert in to a csv file
read.to_csv('read1.csv', index=False)

In [19]:
#it also allow to custom index
read.index=['first', 'Second','Third', 'Fourt']

In [20]:
read

          name  marks       city
first    Harry     99     Rampur
Second   Rohan     34    Kolkata
Third   Skillf     24   Bareilly
Fourt    Shubh     17  Antartica

In [21]:
#creating a data frame in the form of row and columns
newdf =pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [22]:
#printning the data frame
newdf

            0         1         2         3         4
0    0.892609  0.379582  0.459616  0.731280  0.102837
1    0.126735  0.217183  0.747116  0.726674  0.576128
2    0.129785  0.908681  0.402698  0.131292  0.857212
3    0.583388  0.832432  0.081787  0.358866  0.761051
4    0.176305  0.195438  0.817168  0.611010  0.873049
..        ...       ...       ...       ...       ...
329  0.268295  0.789656  0.612692  0.044495  0.138030
330  0.869313  0.402956  0.917728  0.460691  0.983580
331  0.144916  0.092034  0.433733  0.914393  0.788114
332  0.929676  0.175604  0.716878  0.670581  0.192317
333  0.077596  0.453032  0.551257  0.207275  0.764123

[334 rows x 5 columns]

In [23]:
#to know the type 
type(newdf)

pandas.core.frame.DataFrame

In [24]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.497722    0.452686    0.489989    0.489354    0.506398
std      0.281222    0.280856    0.296747    0.293107    0.281999
min      0.003991    0.000487    0.003270    0.000984    0.015183
25%      0.249486    0.213487    0.210827    0.219933    0.266904
50%      0.511594    0.451575    0.501569    0.494143    0.475700
75%      0.727165    0.668538    0.738292    0.761750    0.761165
max      0.998858    0.996606    0.999734    0.996752    0.999468

In [25]:
#to get the info about the df
newdf.head()

          0         1         2         3         4
0  0.892609  0.379582  0.459616  0.731280  0.102837
1  0.126735  0.217183  0.747116  0.726674  0.576128
2  0.129785  0.908681  0.402698  0.131292  0.857212
3  0.583388  0.832432  0.081787  0.358866  0.761051
4  0.176305  0.195438  0.817168  0.611010  0.873049

In [26]:
#to know the data type
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
newdf[0][0]="Bishal Shah"

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/674700252.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]="Bishal Shah"
/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/674700252.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Bishal Shah' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="Bishal Shah"

In [28]:
newdf

               0         1         2         3         4
0    Bishal Shah  0.379582  0.459616  0.731280  0.102837
1       0.126735  0.217183  0.747116  0.726674  0.576128
2       0.129785  0.908681  0.402698  0.131292  0.857212
3       0.583388  0.832432  0.081787  0.358866  0.761051
4       0.176305  0.195438  0.817168  0.611010  0.873049
..           ...       ...       ...       ...       ...
329     0.268295  0.789656  0.612692  0.044495  0.138030
330     0.869313  0.402956  0.917728  0.460691  0.983580
331     0.144916  0.092034  0.433733  0.914393  0.788114
332     0.929676  0.175604  0.716878  0.670581  0.192317
333     0.077596  0.453032  0.551257  0.207275  0.764123

[334 rows x 5 columns]

In [29]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
#printing the index
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [31]:
#columns
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [32]:
#to convert into the numpy
newdf.to_numpy()

array([['Bishal Shah', 0.3795817559443725, 0.4596163376642419,
        0.731279834409338, 0.10283707039907986],
       [0.1267348958808393, 0.21718294998479515, 0.7471160379007307,
        0.7266738184137695, 0.576127724032134],
       [0.1297851500837034, 0.9086812832503722, 0.402697762764179,
        0.13129246362371794, 0.8572122667171105],
       ...,
       [0.14491630184571758, 0.09203419559159953, 0.433732640697982,
        0.9143932209927785, 0.7881144454276299],
       [0.9296764261056909, 0.17560421861289954, 0.7168775059138052,
        0.67058069768149, 0.19231672666077815],
       [0.07759580708699676, 0.45303197644616566, 0.551257041980165,
        0.2072751695973858, 0.764123442548132]],
      shape=(334, 5), dtype=object)

In [33]:
newdf[0][0]=np.random.rand()

In [34]:
newdf

            0         1         2         3         4
0    0.762339  0.379582  0.459616  0.731280  0.102837
1    0.126735  0.217183  0.747116  0.726674  0.576128
2    0.129785  0.908681  0.402698  0.131292  0.857212
3    0.583388  0.832432  0.081787  0.358866  0.761051
4    0.176305  0.195438  0.817168  0.611010  0.873049
..        ...       ...       ...       ...       ...
329  0.268295  0.789656  0.612692  0.044495  0.138030
330  0.869313  0.402956  0.917728  0.460691  0.983580
331  0.144916  0.092034  0.433733  0.914393  0.788114
332  0.929676  0.175604  0.716878  0.670581  0.192317
333  0.077596  0.453032  0.551257  0.207275  0.764123

[334 rows x 5 columns]

In [35]:
newdf.to_numpy()

array([[0.7623385539249425, 0.3795817559443725, 0.4596163376642419,
        0.731279834409338, 0.10283707039907986],
       [0.1267348958808393, 0.21718294998479515, 0.7471160379007307,
        0.7266738184137695, 0.576127724032134],
       [0.1297851500837034, 0.9086812832503722, 0.402697762764179,
        0.13129246362371794, 0.8572122667171105],
       ...,
       [0.14491630184571758, 0.09203419559159953, 0.433732640697982,
        0.9143932209927785, 0.7881144454276299],
       [0.9296764261056909, 0.17560421861289954, 0.7168775059138052,
        0.67058069768149, 0.19231672666077815],
       [0.07759580708699676, 0.45303197644616566, 0.551257041980165,
        0.2072751695973858, 0.764123442548132]],
      shape=(334, 5), dtype=object)

In [36]:
#to convert the row->column and the vice versa
#simply transpose
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.762339,0.126735,0.129785,0.583388,0.176305,0.624835,0.948514,0.676302,0.348574,0.712272,...,0.285004,0.779262,0.198373,0.631563,0.883686,0.268295,0.869313,0.144916,0.929676,0.077596
1,0.379582,0.217183,0.908681,0.832432,0.195438,0.676907,0.159262,0.535406,0.217037,0.679165,...,0.09798,0.226977,0.107108,0.182128,0.45313,0.789656,0.402956,0.092034,0.175604,0.453032
2,0.459616,0.747116,0.402698,0.081787,0.817168,0.420614,0.665268,0.871521,0.080173,0.954362,...,0.648356,0.459555,0.142963,0.3641,0.687012,0.612692,0.917728,0.433733,0.716878,0.551257
3,0.73128,0.726674,0.131292,0.358866,0.61101,0.307082,0.226722,0.417456,0.775276,0.189122,...,0.75819,0.96909,0.667035,0.04846,0.116872,0.044495,0.460691,0.914393,0.670581,0.207275
4,0.102837,0.576128,0.857212,0.761051,0.873049,0.39141,0.495275,0.436332,0.315545,0.673017,...,0.707615,0.058865,0.946286,0.695637,0.36701,0.13803,0.98358,0.788114,0.192317,0.764123

In [37]:
#to reverse sort the rows
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.077596  0.453032  0.551257  0.207275  0.764123
332  0.929676  0.175604  0.716878  0.670581  0.192317
331  0.144916  0.092034  0.433733  0.914393  0.788114
330  0.869313  0.402956  0.917728  0.460691  0.983580
329  0.268295  0.789656  0.612692  0.044495  0.138030
..        ...       ...       ...       ...       ...
4    0.176305  0.195438  0.817168  0.611010  0.873049
3    0.583388  0.832432  0.081787  0.358866  0.761051
2    0.129785  0.908681  0.402698  0.131292  0.857212
1    0.126735  0.217183  0.747116  0.726674  0.576128
0    0.762339  0.379582  0.459616  0.731280  0.102837

[334 rows x 5 columns]

In [38]:
#to reverse sort the columns
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.102837  0.731280  0.459616  0.379582  0.762339
1    0.576128  0.726674  0.747116  0.217183  0.126735
2    0.857212  0.131292  0.402698  0.908681  0.129785
3    0.761051  0.358866  0.081787  0.832432  0.583388
4    0.873049  0.611010  0.817168  0.195438  0.176305
..        ...       ...       ...       ...       ...
329  0.138030  0.044495  0.612692  0.789656  0.268295
330  0.983580  0.460691  0.917728  0.402956  0.869313
331  0.788114  0.914393  0.433733  0.092034  0.144916
332  0.192317  0.670581  0.716878  0.175604  0.929676
333  0.764123  0.207275  0.551257  0.453032  0.077596

[334 rows x 5 columns]

In [39]:
newdf

            0         1         2         3         4
0    0.762339  0.379582  0.459616  0.731280  0.102837
1    0.126735  0.217183  0.747116  0.726674  0.576128
2    0.129785  0.908681  0.402698  0.131292  0.857212
3    0.583388  0.832432  0.081787  0.358866  0.761051
4    0.176305  0.195438  0.817168  0.611010  0.873049
..        ...       ...       ...       ...       ...
329  0.268295  0.789656  0.612692  0.044495  0.138030
330  0.869313  0.402956  0.917728  0.460691  0.983580
331  0.144916  0.092034  0.433733  0.914393  0.788114
332  0.929676  0.175604  0.716878  0.670581  0.192317
333  0.077596  0.453032  0.551257  0.207275  0.764123

[334 rows x 5 columns]

In [40]:
#to access all the elements at 0th column
newdf[0]

0      0.762339
1      0.126735
2      0.129785
3      0.583388
4      0.176305
         ...
329    0.268295
330    0.869313
331    0.144916
332    0.929676
333    0.077596
Name: 0, Length: 334, dtype: object

In [41]:
#inorder to remove the warning, we use .lock[0][0] for the replacement of the value
newdf.loc[0,0]=11

In [42]:
newdf.head()

          0         1         2         3         4
0        11  0.379582  0.459616  0.731280  0.102837
1  0.126735  0.217183  0.747116  0.726674  0.576128
2  0.129785  0.908681  0.402698  0.131292  0.857212
3  0.583388  0.832432  0.081787  0.358866  0.761051
4  0.176305  0.195438  0.817168  0.611010  0.873049

In [43]:
#to set the columns name
newdf.columns=list("ABCDE")

In [44]:
newdf

            A         B         C         D         E
0          11  0.379582  0.459616  0.731280  0.102837
1    0.126735  0.217183  0.747116  0.726674  0.576128
2    0.129785  0.908681  0.402698  0.131292  0.857212
3    0.583388  0.832432  0.081787  0.358866  0.761051
4    0.176305  0.195438  0.817168  0.611010  0.873049
..        ...       ...       ...       ...       ...
329  0.268295  0.789656  0.612692  0.044495  0.138030
330  0.869313  0.402956  0.917728  0.460691  0.983580
331  0.144916  0.092034  0.433733  0.914393  0.788114
332  0.929676  0.175604  0.716878  0.670581  0.192317
333  0.077596  0.453032  0.551257  0.207275  0.764123

[334 rows x 5 columns]

In [45]:
#so now if we want to access 11, we need to [0,'A']

In [46]:
newdf

            A         B         C         D         E
0          11  0.379582  0.459616  0.731280  0.102837
1    0.126735  0.217183  0.747116  0.726674  0.576128
2    0.129785  0.908681  0.402698  0.131292  0.857212
3    0.583388  0.832432  0.081787  0.358866  0.761051
4    0.176305  0.195438  0.817168  0.611010  0.873049
..        ...       ...       ...       ...       ...
329  0.268295  0.789656  0.612692  0.044495  0.138030
330  0.869313  0.402956  0.917728  0.460691  0.983580
331  0.144916  0.092034  0.433733  0.914393  0.788114
332  0.929676  0.175604  0.716878  0.670581  0.192317
333  0.077596  0.453032  0.551257  0.207275  0.764123

[334 rows x 5 columns]

In [47]:
#to remove the last column
newdf.drop(0,axis=0)

            A         B         C         D         E
1    0.126735  0.217183  0.747116  0.726674  0.576128
2    0.129785  0.908681  0.402698  0.131292  0.857212
3    0.583388  0.832432  0.081787  0.358866  0.761051
4    0.176305  0.195438  0.817168  0.611010  0.873049
5    0.624835  0.676907  0.420614  0.307082  0.391410
..        ...       ...       ...       ...       ...
329  0.268295  0.789656  0.612692  0.044495  0.138030
330  0.869313  0.402956  0.917728  0.460691  0.983580
331  0.144916  0.092034  0.433733  0.914393  0.788114
332  0.929676  0.175604  0.716878  0.670581  0.192317
333  0.077596  0.453032  0.551257  0.207275  0.764123

[333 rows x 5 columns]

In [48]:
newdf.loc[0,'A']=90

In [49]:
newdf

            A         B         C         D         E
0          90  0.379582  0.459616  0.731280  0.102837
1    0.126735  0.217183  0.747116  0.726674  0.576128
2    0.129785  0.908681  0.402698  0.131292  0.857212
3    0.583388  0.832432  0.081787  0.358866  0.761051
4    0.176305  0.195438  0.817168  0.611010  0.873049
..        ...       ...       ...       ...       ...
329  0.268295  0.789656  0.612692  0.044495  0.138030
330  0.869313  0.402956  0.917728  0.460691  0.983580
331  0.144916  0.092034  0.433733  0.914393  0.788114
332  0.929676  0.175604  0.716878  0.670581  0.192317
333  0.077596  0.453032  0.551257  0.207275  0.764123

[334 rows x 5 columns]

In [50]:
newdf.loc[0,'A']=901
newdf

            A         B         C         D         E
0         901  0.379582  0.459616  0.731280  0.102837
1    0.126735  0.217183  0.747116  0.726674  0.576128
2    0.129785  0.908681  0.402698  0.131292  0.857212
3    0.583388  0.832432  0.081787  0.358866  0.761051
4    0.176305  0.195438  0.817168  0.611010  0.873049
..        ...       ...       ...       ...       ...
329  0.268295  0.789656  0.612692  0.044495  0.138030
330  0.869313  0.402956  0.917728  0.460691  0.983580
331  0.144916  0.092034  0.433733  0.914393  0.788114
332  0.929676  0.175604  0.716878  0.670581  0.192317
333  0.077596  0.453032  0.551257  0.207275  0.764123

[334 rows x 5 columns]

In [51]:
newdf.head()

          A         B         C         D         E
0       901  0.379582  0.459616  0.731280  0.102837
1  0.126735  0.217183  0.747116  0.726674  0.576128
2  0.129785  0.908681  0.402698  0.131292  0.857212
3  0.583388  0.832432  0.081787  0.358866  0.761051
4  0.176305  0.195438  0.817168  0.611010  0.873049

In [52]:
newdf.drop(1, axis=0)#removed the data of  1st row

            A         B         C         D         E
0         901  0.379582  0.459616  0.731280  0.102837
2    0.129785  0.908681  0.402698  0.131292  0.857212
3    0.583388  0.832432  0.081787  0.358866  0.761051
4    0.176305  0.195438  0.817168  0.611010  0.873049
5    0.624835  0.676907  0.420614  0.307082  0.391410
..        ...       ...       ...       ...       ...
329  0.268295  0.789656  0.612692  0.044495  0.138030
330  0.869313  0.402956  0.917728  0.460691  0.983580
331  0.144916  0.092034  0.433733  0.914393  0.788114
332  0.929676  0.175604  0.716878  0.670581  0.192317
333  0.077596  0.453032  0.551257  0.207275  0.764123

[333 rows x 5 columns]

In [53]:
newdf.drop(3,axis=0)#removed the data of  3rd  row

            A         B         C         D         E
0         901  0.379582  0.459616  0.731280  0.102837
1    0.126735  0.217183  0.747116  0.726674  0.576128
2    0.129785  0.908681  0.402698  0.131292  0.857212
4    0.176305  0.195438  0.817168  0.611010  0.873049
5    0.624835  0.676907  0.420614  0.307082  0.391410
..        ...       ...       ...       ...       ...
329  0.268295  0.789656  0.612692  0.044495  0.138030
330  0.869313  0.402956  0.917728  0.460691  0.983580
331  0.144916  0.092034  0.433733  0.914393  0.788114
332  0.929676  0.175604  0.716878  0.670581  0.192317
333  0.077596  0.453032  0.551257  0.207275  0.764123

[333 rows x 5 columns]

In [57]:
newdf.drop('D', axis=1)#the axis=1 denotes column and 0 denotes row
newdf1=newdf.drop('A', axis=1)#the axis=1 denotes column and 0 denotes row
newdf1

            B         C         D         E
0    0.379582  0.459616  0.731280  0.102837
1    0.217183  0.747116  0.726674  0.576128
2    0.908681  0.402698  0.131292  0.857212
3    0.832432  0.081787  0.358866  0.761051
4    0.195438  0.817168  0.611010  0.873049
..        ...       ...       ...       ...
329  0.789656  0.612692  0.044495  0.138030
330  0.402956  0.917728  0.460691  0.983580
331  0.092034  0.433733  0.914393  0.788114
332  0.175604  0.716878  0.670581  0.192317
333  0.453032  0.551257  0.207275  0.764123

[334 rows x 4 columns]

In [59]:
newdf.head(3)

          A         B         C         D         E
0       901  0.379582  0.459616  0.731280  0.102837
1  0.126735  0.217183  0.747116  0.726674  0.576128
2  0.129785  0.908681  0.402698  0.131292  0.857212

In [411]:
newdf.columns=list("HABCD")

ValueError: Length mismatch: Expected axis has 6 elements, new values have 5 elements

In [413]:
newdf.columns=list("jkilj")

ValueError: Length mismatch: Expected axis has 6 elements, new values have 5 elements

In [414]:
newdf

            A         B         C         D         E      b
0          90  0.759957  0.253988  0.436066  0.006787  901.0
1    0.360816  0.557802  0.866782  0.219495  0.836898    NaN
2    0.076081  0.450950  0.593108  0.781926  0.525689    NaN
3    0.589656  0.195019  0.596404  0.505477  0.328216    NaN
4    0.721344  0.693339  0.841982  0.033885  0.505704    NaN
..        ...       ...       ...       ...       ...    ...
329  0.740811  0.129060  0.138030  0.086998  0.799787    NaN
330   0.20846  0.779011  0.621458  0.767654  0.243451    NaN
331   0.60457  0.402665  0.104031  0.167696  0.980034    NaN
332   0.55561  0.372528  0.121162  0.298581  0.893601    NaN
333  0.537292  0.756346  0.368220  0.959073  0.261297    NaN

[334 rows x 6 columns]